Revit 2027 API
BuiltInFailures.SketchFailures.NotOneCurve Property
 More than one curve not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneCurve { get; }
Public Shared ReadOnly Property NotOneCurve As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneCurve {
	FailureDefinitionId^ get ();
}
static member NotOneCurve : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace